// let x = 10;
// let y = 7;
//
// let result = x > y ? 'x больше чем y' : 'x не больше чем y';
//
// console.log(result);
//



// let num = +(prompt('Введите число'));
//
// if (num % 2 == 0 ) {
// alert('Число ' + ' ' + num + ' ' + 'чётное' );
// }else{
//     alert('Число' + ' ' + num + ' ' + 'нечётное');
// }


// let num = (prompt('Введите число '));
//
// if(+num > 0 && +num < 10 ){
//     alert('кол-во цифр:' + ' ' + num.length + ' ' + 'Число' + ' ' + num + ' ' + 'однозначное положительное' );
// }else if (+num >= 10 && +num < 100){
//     alert('кол-во цифр:' + ' ' + num.length + ' ' + 'Число' + ' ' + num + ' ' + 'двухзначное положительное' );
// }else if (+ num >= 100){
//     alert('кол-во цифр:' + ' ' + num.length + ' ' + 'Число' + ' ' + num + ' ' + 'трехзначное и более, положительное' );
// }else if (+num < 0 && +num > -10){
//     alert('кол-во цифр:' + ' ' + num.length + ' ' + 'Число' + ' ' + num + ' ' + 'однозначное отрицательное' );
// }else if (+ num <= -10 && +num > -100){
//     alert('кол-во цифр:' + ' ' + num.length + ' ' + 'Число' + ' ' + num + ' ' + 'двухзначное отрицательное' );
// }else{
//     alert('кол-во цифр:' + ' ' + num.length + ' ' + 'Число' + ' ' + num + ' ' + 'трехзначное и более, отрицательное' );
// }

// alert('Введите число, а мы попробуем вычислить какое из них максимальное!');
//
// let a = +(prompt('Введите число "a"'));
// let b = +(prompt('Введите число "b"'));
// let c = +(prompt('Введите число "c"'));
//
// if (a >= b && a >= c){
//     alert( 'A' + ' ' + 'Максимальное число!');
// }else if (b >= a && b >= c){
//     alert('B' + ' ' + 'Максимальное число!');
// }else if (c >= a && c >= b){
//     alert('C' + ' ' + 'Максимальное число!');
// }else{
//     alert('Что-то пошле не так! Попробуйте снова ')
// }
//
//
//


// let a = (prompt('Ввдите длину "A"'));
// let b = (prompt('Ввдите длину "B"'));
// let c = (prompt('Ввдите длину "C"'));
//
// if (a + b > c && a + c > b && b + c > a){
//     alert('Треугольник существует!');
// }else{
//     alert('Треугольник не может существовать!');
// }



